_posts/2012-11-01-uva-v1.html
---
layout: post
title: v1
category: UVa
tags:
date: 2012-11-01 22:24:42 CST
---
<div id="preamble">

</div>

<div id="content">
<h1 class="title">UVa V1</h1>

<p><i>NOTE</i>: for the source of the solution, please see <a href="https://github.com/gongzhitaao/AC-Report">https://github.com/gongzhitaao/AC-Report</a>.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 115 - Climbing Trees</a></li>
<li><a href="#sec-2">2 114 - Simulation Wizardry</a></li>
<li><a href="#sec-3">3 113 - Power of Cryptography</a></li>
<li><a href="#sec-4">4 112 - Tree Summing</a></li>
<li><a href="#sec-5">5 111 - History Grading</a></li>
<li><a href="#sec-6">6 110 - Meta-Loopless Sorts</a></li>
<li><a href="#sec-7">7 100 - The SCUD Busters</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 115 - Climbing Trees</h2>
<div class="outline-text-2" id="text-1">

<p> <span class="timestamp-wrapper"> <span class="timestamp">2012-10-16 Tue 21:37</span></span><br/>
</p>
<p>
Basically, a problem of finding the <a href="http://en.wikipedia.org/wiki/Lowest_common_ancestor">least common ancestor</a>. Given two
names <code>NameA</code> and <code>NameB</code>, find their least common ancestor <code>NameC</code>,
which may or may not exit. Depending on how far they are away from each
other in the family tree, generate the corresponding output.
</p>
<p>
I sorted all those names and store parent and children as indices. The
solution is pretty straightforward. Nothing tricky.
</p>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 114 - Simulation Wizardry</h2>
<div class="outline-text-2" id="text-2">

<p> <span class="timestamp-wrapper"> <span class="timestamp">2012-10-11 Thu 21:26</span></span><br/>
</p>
<p>
For the problem: <a href="http://acm.uva.es/p/v1/114.html">http://acm.uva.es/p/v1/114.html</a>
</p>
<p>
Trivial.
</p>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 113 - Power of Cryptography</h2>
<div class="outline-text-2" id="text-3">

<p> <span class="timestamp-wrapper"> <span class="timestamp">2012-10-04 Thu 18:56</span></span><br/>
</p>
<p>
For the problem: <a href="http://acm.uva.es/p/v1/113.html">http://acm.uva.es/p/v1/113.html</a>
</p>
<p>
Simple. Just two notes:
</p>
<ol>
<li>You should be familiar with ranges of important types.  I thought
   10E101 was too large too express in numerical values and even
   considered string representation&hellip; Forget about it ;(

</li>
<li>Logarithm is an useful and powerful tool. Just remember to use it!
</li>
</ol>


<p>
from <a href="http://msdn.microsoft.com/en-us/library/s3f49ktz(v=vs.80).aspx">MSDN</a>:
</p>
<table>
<caption></caption>
<colgroup><col class="left" /><col class="right" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Type Name</th><th scope="col" class="right">Bytes</th><th scope="col" class="left">Other Names</th><th scope="col" class="left">Range of Values</th></tr>
</thead>
<tbody>
<tr><td class="left">int</td><td class="right">4</td><td class="left">signed</td><td class="left">–2,147,483,648 to 2,147,483,647</td></tr>
<tr><td class="left">unsigned int</td><td class="right">4</td><td class="left">unsigned</td><td class="left">0 to 4,294,967,295</td></tr>
<tr><td class="left">_<sub>int64</sub></td><td class="right">8</td><td class="left">long long, singed long long</td><td class="left">–9,223,372,036,854,775,808 to 9,223,372,036,854,775,807</td></tr>
<tr><td class="left">unsigned _<sub>int</sub> 64</td><td class="right">8</td><td class="left">unsigned long long,</td><td class="left">0 to 18,446,744,073,709,551,615</td></tr>
<tr><td class="left">float</td><td class="right">4</td><td class="left">none</td><td class="left">3.4E +/- 38 (7 digits)</td></tr>
<tr><td class="left">double</td><td class="right">8</td><td class="left">none</td><td class="left">1.7E +/- 308 (15 digits)</td></tr>
</tbody>
</table>



</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 112 - Tree Summing</h2>
<div class="outline-text-2" id="text-4">

<p> <span class="timestamp-wrapper"> <span class="timestamp">2012-10-03 Wed 20:02</span></span><br/>
</p>
<p>
For the problem: <a href="http://acm.uva.es/p/v1/112.html">http://acm.uva.es/p/v1/112.html</a>
</p>
<p>
Just parse the S-expression into a tree and find all the sums in the
tree.
</p>
<p>
Actually, we don't have to actually build the tree. What we want is
all the sums of root-to-leaf. We can traverse the istream in a depth
first fashion and find out all the sums along the way without
actually building the tree.
</p>
<p>
One NASTY note here:
</p>
<p>
Integers can be negative. So be careful about negative integers like
<code>-   1</code> or <code>-1</code>.
</p>

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 111 - History Grading</h2>
<div class="outline-text-2" id="text-5">

<p> <span class="timestamp-wrapper"> <span class="timestamp">2012-10-01 Mon 22:29</span></span><br/>
</p>
<p>
For the problem: <a href="http://acm.uva.es/p/v1/111.html">http://acm.uva.es/p/v1/111.html</a>
</p>
<p>
<a href="http://en.wikipedia.org/wiki/Longest_common_subsequence_problem">Longest common sequence</a> problem.
</p>
<p>
Tow notes here:
</p>
<ol>
<li>The input is order of i<sup>th</sup> event, so <code>4 2 3 1</code> means that
     the actual event sequence is <code>4 2 3 1</code>.

</li>
<li>I used <code>while(!cin.eof())</code> to test the EOF which gave me couples of
     WA. Try the normal one <code>while(cin &gt;&gt; x)</code> instead.
</li>
</ol>



</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 110 - Meta-Loopless Sorts</h2>
<div class="outline-text-2" id="text-6">

<p> <span class="timestamp-wrapper"> <span class="timestamp">2012-09-30 Sun 23:38</span></span><br/>
</p>
<p>
For the problem: <a href="http://acm.uva.es/p/v1/110.html">http://acm.uva.es/p/v1/110.html</a>
</p>
<p>
The core of the this problem is to generate permutations.
</p>

</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 100 - The SCUD Busters</h2>
<div class="outline-text-2" id="text-7">

<p> <span class="timestamp-wrapper"> <span class="timestamp">2012-09-27 Thu 21:55</span></span><br/>
</p>
<p>
For the description of problem, please refer to
<a href="http://acm.uva.es/p/v1/100.html">http://acm.uva.es/p/v1/100.html</a>.
</p>
<p>
This is a <a href="http://en.wikipedia.org/wiki/Convex_hull">Convex Hull</a> problem.
</p>
<ol>
<li>Use <a href="http://en.wikipedia.org/wiki/Graham_scan">Graham Scan</a> to find the convex hull.

</li>
<li>There is a <code>left-turn</code> concept in <a href="http://en.wikipedia.org/wiki/Graham_scan">Graham Scan</a>. Use it to check
     whether the bomb falls in a kingdom.

</li>
<li>There seems to be some tricky thing here:

<p>
   a. The area of a kingdom contributes to the result only once
   regardless of how many times a kingdom has been bomded.
</p>
<p>
   b. If a bomd has hit a kingdom, your program will stop checking
   further, 'cause the rules says that the regions of kingdoms does
   not overlap. If your program continues to check whether it falls
   in some other kingdom, it turns out that sometimes it will
   actually falls in some other kingdom as well (NOTE: this is only
   a guess, 'cause the first time my code does not get AC until I
   revise the logic here.)
</p></li>
</ol>


</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-11-01 22:24:42 CST</p>
<p class="author">Author: Zhitao Gong</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
